HELYXcore-4.4.0/examples/legacy/multiphase/interIsoFoam/discInReversedVortexFlow/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.*"
    {
        isoFaceTol      1e-8;
        surfCellTol     1e-8;
        nAlphaBounds    3;
        snapTol         0;
        clip            false;

        nAlphaSubCycles 1;
        cAlpha          1;
    }
}

PIMPLE
{
    frozenFlow      yes;
    momentumPredictor no;
    nCorrectors     -1;
    nNonOrthogonalCorrectors -1;
    pRefCell        0;
    pRefValue       0;
}

// ************************************************************************* //
