HELYXcore-4.4.0/examples/legacy/multiphase/interIsoFoam/discInReversedVortexFlow/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    c1;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            boxes
            (
                (.1 -1e10 0.08) (.9 1e10 0.2)
                (.75 -1e10 0.2) (.92 1e10 0.9)
                (.1 -1e10 0.2) (.25 1e10 0.7)
            );
        }
    }
);

// ************************************************************************* //
